app/controllers/invoice_controller.rb

INSERT INTO "invoices" ("invoice_number", "total", "currency", "invoice_date", "due_date", "vendor_name", "remittance_address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    Invoice.create(
      invoice_number: params[:invoice_number],
      total: params[:total],
      currency: params[:currency],
      invoice_date: params[:invoice_date],
      due_date: params[:due_date],
      vendor_name: params[:vendor_name],
      remittance_address: params[:remittance_address]
    )

SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "invoices" SET "approved" = ?, "approved_at" = ?, "updated_at" = ? WHERE "invoices"."id" = ?  [["approved", 1], ["approved_at", "2019-09-30 21:25:12.795072"], ["updated_at", "2019-09-30 21:25:12.796096"], ["id", 1]]
---
  def approve
    invoice = Invoice.find(params[:invoice_id])
    return unless invoice
    invoice.update_attributes(
      approved: true,
      approved_at: DateTime.now
    )