app/controllers/invoice_controller.rb

SELECT "invoices".* FROM "invoices"
---
  def index
    @invoices = Invoice.all